<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DatabaseSeeder extends Seeder
{
    use WithoutModelEvents;

    public function run(): void
    {
        DB::table('beverages')->insert([
            [
                'id' => 21,
                'name' => 'Лимонад',
                'description' => 'Сладкий безалкогольный напиток, чаще газированный. Обладает прохладительным свойством. Приготавливается исключительно из плодов лимона. Хотя многие заблуждаются, называя любой прохладительный напиток лимонадом.',
            ],
            [
                'id' => 19,
                'name' => 'Сидр',
                'description' => 'Cлабоалкогольный напиток, как правило шампанизированный, получаемый путем сбраживания яблочного сока без добавления дрожжей.',
            ],
            [
                'id' => 3,
                'name' => 'Чай',
                'description' => 'Напиток, получаемый варкой, завариванием или настаиванием листа чайного куста, который предварительно подготавливается специальным образом. Чаем также называется сам лист, предназначенный для приготовления этого напитка.',
            ],
            [
                'id' => 34,
                'name' => 'Вино',
                'description' => 'Алкогольный напиток (крепость: натуральных — 9–16 % об., креплёных — 16–22 % об.), получаемый полным или частичным спиртовым брожением виноградного или плодово-ягодного сока (иногда с добавлением спирта и других веществ — т. н. «креплёное вино»).',
            ],
            [
                'id' => 16,
                'name' => 'Тоник',
                'description' => "Горько-кислый газированный напиток с содержанием хинина. Часто используется для разбавления спиртных напитков, особенно джина, приготовления коктейлей.\nНапиток был изобретен для борьбы с малярией в Индии и Африке. В одно время солдаты Британской Ост-Индской компании смешали тоник с джином, чтобы забить резкий вкус хинина, так появился поныне популярный коктейль Джин-тоник.",
            ],
            [
                'id' => 29,
                'name' => 'Кофе',
                'description' => 'Напиток, изготавливаемый из жареных зёрен кофейного дерева. Благодаря содержанию кофеина оказывает стимулирующее действие.',
            ],
            [
                'id' => 2,
                'name' => 'Квас',
                'description' => 'Национальный слабоалкогольный напиток с объёмной долей этилового спирта не более 1,2%, изготовленный в результате незавершённого спиртового или спиртового и молочнокислого брожения сусла. Обладает приятным, освежающим вкусом, полезен для пищеварения, улучшает обмен веществ, благотворно влияет на сердечно-сосудистую систему.',
            ],
        ]);

        DB::table('bottles')->insert([
            ['id' => 2, 'name' => 'широкая', 'description' => 'очень широкая бутылка', 'img_src' => 'wide.png'],
            ['id' => 3, 'name' => 'квадратная', 'description' => 'обыкновенная квадратная бутылка', 'img_src' => 'square.png'],
            ['id' => 1, 'name' => 'узкая', 'description' => 'высокая узкая бутылка', 'img_src' => 'tall.png'],
        ]);

        DB::table('filled_bottles')->insert([
            ['id' => 2, 'name' => 'ещё одна полная бутылка', 'bottle_id' => 3, 'beverage_id' => 19],
            ['id' => 6, 'name' => 'nestea', 'bottle_id' => 2, 'beverage_id' => 3],
            ['id' => 7, 'name' => 'sprite', 'bottle_id' => 1, 'beverage_id' => 16],
            ['id' => 8, 'name' => 'coca-cola', 'bottle_id' => 3, 'beverage_id' => 2],
            ['id' => 9, 'name' => 'тётя груша', 'bottle_id' => 1, 'beverage_id' => 21],
            ['id' => 10, 'name' => 'Эспрессо', 'bottle_id' => 3, 'beverage_id' => 29],
        ]);
    }
}
